zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/Device/SiliconLabs/BGM26/Include/bgm26_syscfg.h
/* Bit fields for SYSCFG DMEM0RETNCTRL */
#define _SYSCFG_DMEM0RETNCTRL_RESETVALUE                      0x00000000UL                                       /**< Default value for SYSCFG_DMEM0RETNCTRL      */
#define _SYSCFG_DMEM0RETNCTRL_MASK                            0xFFFFFFFFUL                                       /**< Mask for SYSCFG_DMEM0RETNCTRL               */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_SHIFT               0                                                  /**< Shift value for SYSCFG_RAMRETNCTRL          */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_MASK                0xFFFFFFFFUL                                       /**< Bit mask for SYSCFG_RAMRETNCTRL             */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_DEFAULT             0x00000000UL                                       /**< Mode DEFAULT for SYSCFG_DMEM0RETNCTRL       */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_ALLON               0x00000000UL                                       /**< Mode ALLON for SYSCFG_DMEM0RETNCTRL         */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK31               0x80000000UL                                       /**< Mode BLK31 for SYSCFG_DMEM0RETNCTRL         */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK30TO31           0xC0000000UL                                       /**< Mode BLK30TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK29TO31           0xE0000000UL                                       /**< Mode BLK29TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK28TO31           0xF0000000UL                                       /**< Mode BLK28TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK27TO31           0xF8000000UL                                       /**< Mode BLK27TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK26TO31           0xFC000000UL                                       /**< Mode BLK26TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK25TO31           0xFE000000UL                                       /**< Mode BLK25TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK24TO31           0xFF000000UL                                       /**< Mode BLK24TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK23TO31           0xFF800000UL                                       /**< Mode BLK23TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK22TO31           0xFFC00000UL                                       /**< Mode BLK22TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK21TO31           0xFFE00000UL                                       /**< Mode BLK21TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK20TO31           0xFFF00000UL                                       /**< Mode BLK20TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK19TO31           0xFFF80000UL                                       /**< Mode BLK19TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK18TO31           0xFFFC0000UL                                       /**< Mode BLK18TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK17TO31           0xFFFE0000UL                                       /**< Mode BLK17TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK16TO31           0xFFFF0000UL                                       /**< Mode BLK16TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK15TO31           0xFFFF8000UL                                       /**< Mode BLK15TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK14TO31           0xFFFFC000UL                                       /**< Mode BLK14TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK13TO31           0xFFFFE000UL                                       /**< Mode BLK13TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK12TO31           0xFFFFF000UL                                       /**< Mode BLK12TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK11TO31           0xFFFFF800UL                                       /**< Mode BLK11TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK10TO31           0xFFFFFC00UL                                       /**< Mode BLK10TO31 for SYSCFG_DMEM0RETNCTRL     */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK9TO31            0xFFFFFE00UL                                       /**< Mode BLK9TO31 for SYSCFG_DMEM0RETNCTRL      */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK8TO31            0xFFFFFF00UL                                       /**< Mode BLK8TO31 for SYSCFG_DMEM0RETNCTRL      */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK7TO31            0xFFFFFF80UL                                       /**< Mode BLK7TO31 for SYSCFG_DMEM0RETNCTRL      */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK6TO31            0xFFFFFFC0UL                                       /**< Mode BLK6TO31 for SYSCFG_DMEM0RETNCTRL      */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK5TO31            0xFFFFFFE0UL                                       /**< Mode BLK5TO31 for SYSCFG_DMEM0RETNCTRL      */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK4TO31            0xFFFFFFF0UL                                       /**< Mode BLK4TO31 for SYSCFG_DMEM0RETNCTRL      */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK3TO31            0xFFFFFFF8UL                                       /**< Mode BLK3TO31 for SYSCFG_DMEM0RETNCTRL      */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK2TO31            0xFFFFFFFCUL                                       /**< Mode BLK2TO31 for SYSCFG_DMEM0RETNCTRL      */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK1TO31            0xFFFFFFFEUL                                       /**< Mode BLK1TO31 for SYSCFG_DMEM0RETNCTRL      */
#define _SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_ALLOFF              0xFFFFFFFFUL                                       /**< Mode ALLOFF for SYSCFG_DMEM0RETNCTRL        */
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_DEFAULT              (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_DEFAULT << 0)   /**< Shifted mode DEFAULT for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_ALLON                (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_ALLON << 0)     /**< Shifted mode ALLON for SYSCFG_DMEM0RETNCTRL */
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK31                (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK31 << 0)     /**< Shifted mode BLK31 for SYSCFG_DMEM0RETNCTRL */
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK30TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK30TO31 << 0) /**< Shifted mode BLK30TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK29TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK29TO31 << 0) /**< Shifted mode BLK29TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK28TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK28TO31 << 0) /**< Shifted mode BLK28TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK27TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK27TO31 << 0) /**< Shifted mode BLK27TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK26TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK26TO31 << 0) /**< Shifted mode BLK26TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK25TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK25TO31 << 0) /**< Shifted mode BLK25TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK24TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK24TO31 << 0) /**< Shifted mode BLK24TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK23TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK23TO31 << 0) /**< Shifted mode BLK23TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK22TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK22TO31 << 0) /**< Shifted mode BLK22TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK21TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK21TO31 << 0) /**< Shifted mode BLK21TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK20TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK20TO31 << 0) /**< Shifted mode BLK20TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK19TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK19TO31 << 0) /**< Shifted mode BLK19TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK18TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK18TO31 << 0) /**< Shifted mode BLK18TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK17TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK17TO31 << 0) /**< Shifted mode BLK17TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK16TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK16TO31 << 0) /**< Shifted mode BLK16TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK15TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK15TO31 << 0) /**< Shifted mode BLK15TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK14TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK14TO31 << 0) /**< Shifted mode BLK14TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK13TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK13TO31 << 0) /**< Shifted mode BLK13TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK12TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK12TO31 << 0) /**< Shifted mode BLK12TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK11TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK11TO31 << 0) /**< Shifted mode BLK11TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK10TO31            (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK10TO31 << 0) /**< Shifted mode BLK10TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK9TO31             (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK9TO31 << 0)  /**< Shifted mode BLK9TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK8TO31             (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK8TO31 << 0)  /**< Shifted mode BLK8TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK7TO31             (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK7TO31 << 0)  /**< Shifted mode BLK7TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK6TO31             (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK6TO31 << 0)  /**< Shifted mode BLK6TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK5TO31             (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK5TO31 << 0)  /**< Shifted mode BLK5TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK4TO31             (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK4TO31 << 0)  /**< Shifted mode BLK4TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK3TO31             (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK3TO31 << 0)  /**< Shifted mode BLK3TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK2TO31             (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK2TO31 << 0)  /**< Shifted mode BLK2TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK1TO31             (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_BLK1TO31 << 0)  /**< Shifted mode BLK1TO31 for SYSCFG_DMEM0RETNCTRL*/
#define SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_ALLOFF               (_SYSCFG_DMEM0RETNCTRL_RAMRETNCTRL_ALLOFF << 0)    /**< Shifted mode ALLOFF for SYSCFG_DMEM0RETNCTRL*/

/* Bit fields for SYSCFG RAMBIASCONF */
#define _SYSCFG_RAMBIASCONF_RESETVALUE                        0x00000002UL                                   /**< Default value for SYSCFG_RAMBIASCONF        */
#define _SYSCFG_RAMBIASCONF_MASK                              0x0000000FUL                                   /**< Mask for SYSCFG_RAMBIASCONF                 */
#define _SYSCFG_RAMBIASCONF_RAMBIASCTRL_SHIFT                 0                                              /**< Shift value for SYSCFG_RAMBIASCTRL          */
#define _SYSCFG_RAMBIASCONF_RAMBIASCTRL_MASK                  0xFUL                                          /**< Bit mask for SYSCFG_RAMBIASCTRL             */
#define _SYSCFG_RAMBIASCONF_RAMBIASCTRL_DEFAULT               0x00000002UL                                   /**< Mode DEFAULT for SYSCFG_RAMBIASCONF         */
#define _SYSCFG_RAMBIASCONF_RAMBIASCTRL_No                    0x00000000UL                                   /**< Mode No for SYSCFG_RAMBIASCONF              */
#define _SYSCFG_RAMBIASCONF_RAMBIASCTRL_VSB100                0x00000001UL                                   /**< Mode VSB100 for SYSCFG_RAMBIASCONF          */
#define _SYSCFG_RAMBIASCONF_RAMBIASCTRL_VSB200                0x00000002UL                                   /**< Mode VSB200 for SYSCFG_RAMBIASCONF          */
#define _SYSCFG_RAMBIASCONF_RAMBIASCTRL_VSB300                0x00000004UL                                   /**< Mode VSB300 for SYSCFG_RAMBIASCONF          */
#define _SYSCFG_RAMBIASCONF_RAMBIASCTRL_VSB400                0x00000008UL                                   /**< Mode VSB400 for SYSCFG_RAMBIASCONF          */
#define SYSCFG_RAMBIASCONF_RAMBIASCTRL_DEFAULT                (_SYSCFG_RAMBIASCONF_RAMBIASCTRL_DEFAULT << 0) /**< Shifted mode DEFAULT for SYSCFG_RAMBIASCONF */
#define SYSCFG_RAMBIASCONF_RAMBIASCTRL_No                     (_SYSCFG_RAMBIASCONF_RAMBIASCTRL_No << 0)      /**< Shifted mode No for SYSCFG_RAMBIASCONF      */
#define SYSCFG_RAMBIASCONF_RAMBIASCTRL_VSB100                 (_SYSCFG_RAMBIASCONF_RAMBIASCTRL_VSB100 << 0)  /**< Shifted mode VSB100 for SYSCFG_RAMBIASCONF  */
#define SYSCFG_RAMBIASCONF_RAMBIASCTRL_VSB200                 (_SYSCFG_RAMBIASCONF_RAMBIASCTRL_VSB200 << 0)  /**< Shifted mode VSB200 for SYSCFG_RAMBIASCONF  */
#define SYSCFG_RAMBIASCONF_RAMBIASCTRL_VSB300                 (_SYSCFG_RAMBIASCONF_RAMBIASCTRL_VSB300 << 0)  /**< Shifted mode VSB300 for SYSCFG_RAMBIASCONF  */
#define SYSCFG_RAMBIASCONF_RAMBIASCTRL_VSB400                 (_SYSCFG_RAMBIASCONF_RAMBIASCTRL_VSB400 << 0)  /**< Shifted mode VSB400 for SYSCFG_RAMBIASCONF  */

/* Bit fields for SYSCFG RADIORAMRETNCTRL */
#define _SYSCFG_RADIORAMRETNCTRL_RESETVALUE                   0x00000000UL                                           /**< Default value for SYSCFG_RADIORAMRETNCTRL   */
#define _SYSCFG_RADIORAMRETNCTRL_MASK                         0x00000103UL                                           /**< Mask for SYSCFG_RADIORAMRETNCTRL            */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_SHIFT         0                                                      /**< Shift value for SYSCFG_SEQRAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_MASK          0x3UL                                                  /**< Bit mask for SYSCFG_SEQRAMRETNCTRL          */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_DEFAULT       0x00000000UL                                           /**< Mode DEFAULT for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_ALLON         0x00000000UL                                           /**< Mode ALLON for SYSCFG_RADIORAMRETNCTRL      */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK0          0x00000001UL                                           /**< Mode BLK0 for SYSCFG_RADIORAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK1          0x00000002UL                                           /**< Mode BLK1 for SYSCFG_RADIORAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_ALLOFF        0x00000003UL                                           /**< Mode ALLOFF for SYSCFG_RADIORAMRETNCTRL     */
#define SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_DEFAULT        (_SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_DEFAULT << 0) /**< Shifted mode DEFAULT for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_ALLON          (_SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_ALLON << 0)   /**< Shifted mode ALLON for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK0           (_SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK0 << 0)    /**< Shifted mode BLK0 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK1           (_SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_BLK1 << 0)    /**< Shifted mode BLK1 for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_ALLOFF         (_SYSCFG_RADIORAMRETNCTRL_SEQRAMRETNCTRL_ALLOFF << 0)  /**< Shifted mode ALLOFF for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL                (0x1UL << 8)                                           /**< FRCRAM Retention Control                    */
#define _SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_SHIFT         8                                                      /**< Shift value for SYSCFG_FRCRAMRETNCTRL       */
#define _SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_MASK          0x100UL                                                /**< Bit mask for SYSCFG_FRCRAMRETNCTRL          */
#define _SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_DEFAULT       0x00000000UL                                           /**< Mode DEFAULT for SYSCFG_RADIORAMRETNCTRL    */
#define _SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_ALLON         0x00000000UL                                           /**< Mode ALLON for SYSCFG_RADIORAMRETNCTRL      */
#define _SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_ALLOFF        0x00000001UL                                           /**< Mode ALLOFF for SYSCFG_RADIORAMRETNCTRL     */
#define SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_DEFAULT        (_SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_DEFAULT << 8) /**< Shifted mode DEFAULT for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_ALLON          (_SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_ALLON << 8)   /**< Shifted mode ALLON for SYSCFG_RADIORAMRETNCTRL*/
#define SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_ALLOFF         (_SYSCFG_RADIORAMRETNCTRL_FRCRAMRETNCTRL_ALLOFF << 8)  /**< Shifted mode ALLOFF for SYSCFG_RADIORAMRETNCTRL*/

